{
  "title": "Level 12",
  "teaser": "Balancing Drums",
  "desc": "“Wow, not even a single mistake on your mid-term exam? Well done, my friend! Welcome back to the outside of the palace. Let’s freeze the time and go inside again.”\nYou pass the Okay room and this time you go to the right, passing the sleeping Tiger guarding his Treasure. You go left from here into the Noble Ninja’s room, and after observing him breaking another brick shouting something angry in Japanese, you head left again. \nThe next room has black wavy foam on the walls and there is no echo here like in a music studio. Suddenly, a light beam points towards the corner of the room. You hear drums playing loud from what appears to be a Donkey sitting behind a concert drum set, masterfully spinning the sticks while drumming a complicated rhythm and ends with the long hi-hat sound. \n“Meet Donkey the Drummer!” introduced you the guide while floating towards the next left door. \nAs you enter the left room you feel a blow of strong wind, and you almost fall down, but you manage to stop and notice that that there is no floor. You can see small roads and tiny cars moving hundreds of meters below! There is a cable tied between you and the other building in front. Further down the cable you see two guys balancing on the cable holding each other’s hands.\n“Have you heard of the famous Balancing Brothers? Here they are!” said the energy ball and flew towards the brothers. He came closer to them and nudged them slightly here and there, apparently causing troubles to the brothers that lost their perfect balance for a moment but regained it back quickly.\n“See? They are really good at it! Let’s get back to the Donkey the Drummer!”\nYou pass the Donkey, that tries to impress you with a complicated heavy metal passage, while you move towards the opposite door. \nYou open the right door, and you instantly feel a smell of paper and ink, like a new book should smell. In the middle of the room, you see a xerox machine, surrounded by paper boxes. The machine moves and shakes as it scans and prints something while making typical printer sounds.\n“This is the Xerox room; you can copy anything you want here. There are no rooms further from here, so let’s practice the new rooms!”\n",
  "patterns": {
    "1011": "Noble Ninja",
    "10111": "Donkey the Drummer",
    "101111": "Balancing Brothers",
    "1011101": "Xerox Room"
  },
  "correctAnswer": "random",
  "failText": "Please try again!",
  "requiredStreak": 10,
  "tapDuration": 96,
  "tapDelay": 96
}